vinhlephu-lpv/robot-ws/src/esp32_source/code2908.ino
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>

// ============================================================
//  1. CẤU HÌNH PHẦN CỨNG & THÔNG SỐ XE
// ============================================================
#define ENCODER_PPR             200       // Xung/vòng trục bánh xe
#define WHEEL_DIAMETER_M        0.20f     // Đường kính bánh xe: 200mm (0.2m)
#define WHEEL_CIRCUMFERENCE     (PI * WHEEL_DIAMETER_M)  // Chu vi bánh ≈ 0.6283m

// Khoảng thời gian chu kỳ tính toán
#define SPEED_CALC_INTERVAL_MS  50        // Tính tốc độ mỗi 50ms (20 Hz)
#define RAMP_INTERVAL_MS        25        // Khởi động mềm mỗi 25ms (40 Hz)
#define DEBUG_PRINT_INTERVAL_MS 500       // In debug Serial mỗi 500ms

// Ngưỡng Deadzone & Giới hạn gia tốc PWM (Tối ưu lực kéo vượt địa hình với nguồn xả cao 90A)
#define MIN_PWM                 95        // Tăng từ 75 lên 95: Vượt triệt để deadzone motor 775 24V có tải nặng
#define MAX_PWM_CHANGE_UP       55        // Tăng từ 35 lên 55: Bơm lực cực nhanh khi khởi động và leo cản dốc
#define MAX_PWM_CHANGE_DOWN     25        // Giảm tốc mượt mà bảo vệ cơ cấu nhông
#define RAMP_STEP_MAX           12.0f     // Tăng từ 8.0f lên 12.0f: Bơm gia tốc nhanh
#define RAMP_STEP_MIN           2.5f      // Tăng từ 0.5f lên 2.5f: Bước khởi động dứt khoát không bị ì
#define RAMP_STEP_STOP_MAX      5.0f      // Bước giảm tốc êm ái bảo vệ hộp số

// Lọc nhiễu Encoder & Hiệu chuẩn khoảng cách
#define MIN_ENC_INTERVAL_US     350       // Tăng từ 200 lên 350us: Chặn đứng 100% gai nhiễu điện từ tia lửa chổi than 775
#define MAX_PLAUSIBLE_RPM       350.0f    // Giới hạn vật lý lọc đột biến RPM
#define MOVING_AVG_SIZE         4         // Số mẫu trung bình trượt RPM
#define DERIVATIVE_FILTER       0.6f      // Hệ số lọc thông thấp vi phân PID
#define DEFAULT_CALIB_SCALE     1.0f      // Hệ số hiệu chuẩn quãng đường thực tế
#define DECEL_DIST_THRESHOLD    0.75f     // Khoảng cách bắt đầu giảm tốc êm trước đích: 75cm (0.75m)
#define DEFAULT_CRAWL_RPM       25.0f     // Tốc độ chạy bò chuẩn xác khi gần đích (RPM)

// 3 Bộ lọc nâng cao: Khử rung tốc độ thấp, Khóa hướng thẳng và Vùng chết PID
#define EMA_LOW_SPEED_ALPHA     0.35f     // Hệ số làm mịn EMA tốc độ thấp (15-30 RPM) triệt tiêu tiếng rung
#define EMA_HIGH_SPEED_ALPHA    0.70f     // Hệ số EMA tốc độ cao (đáp ứng tức thì)
#define K_HEADING_LOCK          35.0f     // Hệ số khóa hướng vi sai (chống xẹo xe khi bánh trượt)
#define PID_ERROR_DEADBAND      0.8f      // Vùng chết sai số PID (giúp động cơ êm và mát driver)

// Phát hiện kẹt bánh (Stall Detection) - Cho phép 1.2s phát huy 100% momen xoắn vượt gờ trước khi ngắt nhiệt
#define STALL_DETECT_MS         1200
#define STALL_PWM_THRESHOLD     180
#define STALL_RPM_THRESHOLD     4.0f

// Chế độ dự phòng nếu có 1 encoder bị hỏng (false: đủ 4 encoder)
#define WHEEL3_ENCODER_FAULT    false

// ============================================================
//  2. SƠ ĐỒ CHÂN GPIO BTS7960 (4 DRIVER ĐỘC LẬP)
// ============================================================
#define DRV1_RPWM   47   // Bánh 0: Trái trước
#define DRV1_LPWM   4
#define DRV2_RPWM   45   // Bánh 1: Trái sau
#define DRV2_LPWM   18
#define DRV3_RPWM   13   // Bánh 2: Phải trước
#define DRV3_LPWM   15
#define DRV4_RPWM   7   // Bánh 3: Phải sau
#define DRV4_LPWM   8

// Cờ đảo chiều driver (+1: bình thường, -1: đảo chiều nếu đấu ngược dây)
#define INV_DRV1     1
#define INV_DRV2     1
#define INV_DRV3     1
#define INV_DRV4    -1

#define RGB_LED_PIN 48   // Chân LED RGB tích hợp ESP32-S3

// ============================================================
//  3. CẤU HÌNH WIFI & WEBSERVER
// ============================================================
const char* ssid     = "CTU";
const char* password = "";
WebServer server(80);

const int PWM_FREQ = 7000;
const int PWM_RES  = 8;      // 8-bit: 0 - 255
const int CH_DRV1_F = 0, CH_DRV1_R = 1;
const int CH_DRV2_F = 2, CH_DRV2_R = 3;
const int CH_DRV3_F = 4, CH_DRV3_R = 5;
const int CH_DRV4_F = 6, CH_DRV4_R = 7;

// ============================================================
//  4. CẤU TRÚC DỮ LIỆU ENCODER, PID & SLEW RATE
// ============================================================
struct EncoderData {
  int   pinA, pinB;
  int   sign;                       // +1 bình thường, -1 đảo dấu đếm xung
  volatile long count;
  long  lastSpeedCount;
  float rpm;
  float prevFilteredRpm;
  float speed_ms;
  float distance_m;
  float rpmBuffer[MOVING_AVG_SIZE];
  int   bufferIndex;
  float rawRpmHist[2];              // Bộ nhớ 2 chu kỳ quá khứ cho Bộ lọc Trung vị 3 điểm (Median-3 Filter)
};

// Sơ đồ 4 Encoder: Trái trước (16,17), Trái sau (38,39), Phải trước (10,11), Phải sau (40,41)
EncoderData enc[4] = {
  {16, 17,  1, 0, 0, 0, 0, 0, 0, {0}, 0, {0, 0}}, // enc[0]: Bánh trái trước
  {38, 39,  1, 0, 0, 0, 0, 0, 0, {0}, 0, {0, 0}}, // enc[1]: Bánh trái sau
  {40, 41,  1, 0, 0, 0, 0, 0, 0, {0}, 0, {0, 0}}, // enc[2]: Bánh phải trước (đã đổi ngược chiều đếm)
  {10, 11,  1, 0, 0, 0, 0, 0, 0, {0}, 0, {0, 0}}  // enc[3]: Bánh phải sau (đã đổi ngược chiều đếm)
};

struct WheelPID {
  float kp, ki, kd;
  float targetRPM;
  float integral;
  float lastError;
  float filteredDeriv;
  int   pwmOutput;
  int   prevPwmOutput;
  bool  enabled;
};

// Hệ số PID tối ưu đồng bộ 4 bánh: Cân bằng vàng (Êm ái, bám tốc chính xác, lực kéo cực khỏe)
#define PID_KP              1.050f
#define PID_KI              0.900f
#define PID_KD              0.080f
#define K_SYNC_CROSS_WHEEL  0.850f  // Hệ số bù đồng tốc liên bánh xe
#define K_LR_BALANCE        1.500f  // Hệ số khóa cân bằng đồng tốc cụm Trái - Phải

WheelPID wpid[4] = {
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, false}, // Bánh 1: Trái trước
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, false}, // Bánh 2: Trái sau
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, false}, // Bánh 3: Phải trước
  {PID_KP, PID_KI, PID_KD, 0, 0, 0, 0, 0, 0, false}  // Bánh 4: Phải sau
};

// Cấu trúc Bộ Lọc Kalman 1D cho từng bánh xe (Tách nhiễu Gaussian và triệt tiêu trễ pha)
struct Kalman1D {
  float x; // Ước lượng vận tốc RPM
  float p; // Sai số ước lượng
  float q; // Độ bất định mô hình vật lý
  float r; // Độ nhiễu đo lường encoder
  float k; // Hệ số tăng Kalman
};

Kalman1D kfRpm[4] = {
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f}, // Bánh 1: Tăng độ tin cậy mô hình, triệt tiêu hoàn toàn gai nhiễu encoder
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f}, // Bánh 2
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f}, // Bánh 3
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f}  // Bánh 4
};

