vinhlephu-lpv/robot-ws/src/esp32_source/code2908.ino
  command.toUpperCase();

  // Lệnh bật/tắt chế độ PID (chuyển đổi linh hoạt giữa Điều khiển trực tiếp PWM và Điều khiển vòng kín PID):
  if (command == "PID 0" || command == "PID OFF" || command == "PID=0") {
    pidGlobalEnabled = false;
    for (int i = 0; i < 4; i++) {
      wpid[i].enabled = false;
      wpid[i].integral = 0;
    }
    if (isMoving && currentDirection != "STOP") writeSpeed(currentSpeed);
    Serial.println("\n[MODE] >> DA CHUYEN SANG CHE DO DIEU KHIEN PWM TRUC TIEP (Khong dung PID) <<\n");
    return;
  }
  if (command == "PID 1" || command == "PID ON" || command == "PID=1") {
    pidGlobalEnabled = true;
    for (int i = 0; i < 4; i++) {
      wpid[i].enabled = true;
      wpid[i].integral = 0;
      wpid[i].targetRPM = globalTargetRPM;
    }
    Serial.println("\n[MODE] >> DA CHUYEN SANG CHE DO DONG TOC PID MO-MEN XOAN CAO <<\n");
    return;
  }

  // 1. Nhận lệnh chỉnh tốc độ: "SPEED <val>", "PWM <val>", "TOCDO <val>", "S <val>"
  if (command.startsWith("SPEED ") || command.startsWith("PWM ") || 
      command.startsWith("TOCDO ") || command.startsWith("S ")) {
    int spd = command.substring(command.indexOf(' ') + 1).toInt();
    setVehicleSpeed(spd);
    return;
  }

  // 2. Nhận lệnh dạng: "SPEED=150", "PWM=150"
  if (command.startsWith("SPEED=") || command.startsWith("PWM=")) {
    int spd = command.substring(command.indexOf('=') + 1).toInt();
    setVehicleSpeed(spd);
    return;
  }

  // 3. Nhận lệnh dạng "S150" hoặc "P180" (thường dùng trong app joystick)
  if ((command.startsWith("S") || command.startsWith("P")) && command.length() > 1 && isDigit(command.charAt(1))) {
    int spd = command.substring(1).toInt();
    setVehicleSpeed(spd);
    return;
  }

  // 4. Nhận trực tiếp số từ 1 đến 255 (ví dụ người dùng gõ thẳng "120", "180" vào ô lệnh)
  int numVal = command.toInt();
  if (numVal > 0 && numVal <= 255 && command.length() <= 3) {
    bool isAllDigits = true;
    for (unsigned int c = 0; c < command.length(); c++) {
      if (!isDigit(command.charAt(c))) { isAllDigits = false; break; }
    }
    if (isAllDigits) {
      setVehicleSpeed(numVal);
      return;
    }
  }

  // 5. Chuẩn ký tự tốc độ của các App điều khiển xe RC (0..9 và Q):
  if (command == "0") { setVehicleSpeed(0); return; }
  else if (command == "1") { setVehicleSpeed(40); return; }
  else if (command == "2") { setVehicleSpeed(65); return; }
  else if (command == "3") { setVehicleSpeed(90); return; }
  else if (command == "4") { setVehicleSpeed(120); return; }
  else if (command == "5") { setVehicleSpeed(150); return; }
  else if (command == "6") { setVehicleSpeed(175); return; }
  else if (command == "7") { setVehicleSpeed(200); return; }
  else if (command == "8") { setVehicleSpeed(225); return; }
  else if (command == "9") { setVehicleSpeed(245); return; }
  else if (command == "Q") { setVehicleSpeed(255); return; }

  // Chuẩn hóa tên lệnh điều khiển liên tục (chạy cho đến khi bấm dừng)
  if (command == "FORWARD" || command == "TIEN" || command == "F" || command == "W" || command.startsWith("TIEN"))      command = "FORWARD";
  else if (command == "BACKWARD" || command == "LUI" || command == "B" || command == "S" || command.startsWith("LUI"))  command = "BACKWARD";
  else if (command == "LEFT" || command == "TRAI" || command == "L" || command == "A" || command.startsWith("TRAI"))    command = "LEFT";
  else if (command == "RIGHT" || command == "PHAI" || command == "R" || command == "D" || command.startsWith("PHAI"))   command = "RIGHT";
  else if (command == "STOP" || command == "DUNG" || command == "X" || command == "SPACE")                               command = "STOP";
  else if (command == "EMERGENCY_STOP" || command == "ESTOP")                                                            command = "EMERGENCY_STOP";

  if (command == "FORWARD" || command == "BACKWARD" || command == "LEFT" || command == "RIGHT") {
    isPositionAnchorLocked = false;
    isDistanceMode    = false; // KHÔNG chạy theo giới hạn mét, chạy liên tục
    isMoving          = true;
    manualDriveActive = true;
    currentDirection  = command;

    if (pidGlobalEnabled) {
      for (int i = 0; i < 4; i++) {
        wpid[i].targetRPM = globalTargetRPM;
        // Mồi tích phân khởi động ban đầu khi xe xuất phát từ trạng thái dừng để bứt tốc ngay
        if (abs(enc[i].rpm) < 2.0f) wpid[i].integral = 30.0f;
      }
      Serial.printf("[RUN] Chay lien tuc: %s | Target: %.1f RPM | MIN_PWM: %d (Nhan STOP de dung)\n", 
                    command.c_str(), globalTargetRPM, MIN_PWM);
    } else {
      writeSpeed(currentSpeed);
      Serial.println("[RUN] Chay lien tuc: " + command + " | PWM: " + String(currentSpeed) + " (Nhan STOP de dung)");
    }
  } else if (command == "STOP" || command == "stop") {
    stopMotor(false); // Dừng êm ái qua Slew Rate
  } else if (command == "EMERGENCY_STOP" || command == "estop") {
    stopMotor(true);  // Dừng ngắt điện khẩn cấp tức thì
  }
}

// ============================================================
//  11. IN DEBUG SERIAL MONITOR (500ms)
// ============================================================
void printDebugInfo() {
  if (currentDirection == "ROS") return; // Nhường băng thông Serial cho gói @ODOM của ROS 2

  unsigned long now = millis();
  if (now - lastDebugPrintTime < DEBUG_PRINT_INTERVAL_MS) return;
  lastDebugPrintTime = now;

  bool active = isMoving;
  for (int i = 0; i < 4; i++) if (enc[i].rpm != 0) active = true;
  if (!active) return;

  int healthyCount = 0;
  for (int i = 0; i < 4; i++) if (!wHealth[i].isFaulty) healthyCount++;

  Serial.println("----");
  if (isDistanceMode) {
    float traveled = (abs(enc[0].distance_m - startDistMeters[0]) + abs(enc[1].distance_m - startDistMeters[1]) +
                      abs(enc[2].distance_m - startDistMeters[2]) + abs(enc[3].distance_m - startDistMeters[3])) / 4.0f;
    Serial.printf("[DIST TRACKING] Đang chạy: %.3f / %.2fm (Còn lại: %.3fm | Target: %.1f RPM)\n",
                  traveled, targetDistMeters, max(0.0f, targetDistMeters - traveled), wpid[0].targetRPM);
  }
  if (healthyCount < 4) {
    Serial.printf("[TRACTION] CHẾ ĐỘ BÙ MÔ-MEN: Phát hiện %d bánh sự cố! Bơm lực kéo cho %d bánh lành.\n",
                  4 - healthyCount, healthyCount);
  }

